import java.util.Scanner;


//문자열 메서드 정리
//indexOf():
//첫번째 인자 : 찾을 특정 문자
//두번째 인자 : 시작할 위치 
//특정 문자나 문자열을 앞에서 부터 처음 발견되는 인덱스를 반환함
//만약 찾지 못 할 경우 -1 반환

//lastIndexOf():
//첫번째 인자 : 찾을 특정 문자
//두번째 인자 : 시작할 위치
//특정 문자나 문자열을 뒤에서 부터 처음 발견되는 인덱스를 반환함
//먄약 찾지 못 할 경우 -1 반환

//substring():
//첫번째 인자 : 시작값
//두번째 인자 : 종료값 (종료값은 포함 안됨)
//문자열를 잘라서 반환함 만약 종료값을 생략하면 시작값부터 문자열 끝까지 문자열을 자른다

//substr():
//첫번째 인자 : 시작값
//두번째 인자 : 길이
//문자열을 잘라서 반환함 만약 길이를 생략하면 시작값부터 문자열 끝까지 문자열을 자른다.


class Main_2{
	
	public static void main(String[] args) {
		
	}
}